In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
from scipy.stats import shapiro

%matplotlib inline

In [24]:
df1 = pd.read_csv('../dataset/Bdata.csv')
df2 = pd.read_csv('../dataset/gdp_ineq.csv')
df3 = pd.read_csv('../dataset/deaths-attributed-to-alcohol-use-by-age.csv')

In [25]:
display(df1.head())
display(df2.head())
display(df3.head())

,Entity,Year,Total government spending percapita (per capita USD PPP),Deaths,Over
0,Australia,2009,15670.84,1416.522917,False
1,Australia,2010,15484.24,1439.252130,False
2,Australia,2011,16146.34,1454.194877,True
3,Australia,2012,15628.89,1449.744176,False
4,Australia,2013,17186.98,1503.284879,True

,Entity,Year,Market Income,Disposable_Income,RoundYear,Percent_GDP,MoreThanMean
0,Australia,1981,0.405,0.282,1981.0,10.637890,0
1,Australia,1985,0.440,0.293,1985.0,10.296414,0
2,Australia,1989,0.440,0.304,1989.0,10.268000,0
3,Australia,1995,0.483,0.311,1995.0,12.088000,0
4,Australia,2001,0.498,0.320,2001.0,13.131000,0

,Entity,Code,Year,under 5 (deaths),70 and older (deaths),50-69 (deaths),5-14 (deaths),15-49 (deaths)
0,Afghanistan,AFG,1990,NaN,-1.232956,159.044982,0.638576,198.078705
1,Afghanistan,AFG,1991,NaN,-9.539797,134.088808,0.631198,195.418252
2,Afghanistan,AFG,1992,NaN,-17.965002,107.256543,0.697342,203.268134
3,Afghanistan,AFG,1993,NaN,-24.962000,83.888735,0.825245,218.377779
4,Afghanistan,AFG,1994,NaN,-30.838953,62.871469,0.884239,217.774814

In [20]:

df_complete.shape

(449, 10)

TypeError: unsupported operand type(s) for +: 'int' and 'str'